

/*
            1.Int 

formula:   int  атауы = бастапқы мәні;
        int b = 10; 
        b = 40; 

Заңдылық - 1: Бүтін санды бүтін санға бөлгенде жауап міндетті түрде бүтін сан шыгады 
зандылык - 2  кіші санды улкен санга болгенде 0 шыгад
зандылык - 3  кышы санды улкен санга модуль жасаганда кышы саннын озы шыгады
*/
#include <iostream>
using namespace std; 


int main()
{       
        int a = 32768;
        
/*
        int  ----4 byte = 32 bit ---" -2^31 ~ 2^31-1 "  ：-2147483647.~2147483647.
       short----2 byte = 16 bit ---" -2^15 ~ 2^15 "  ：-32768~32767
        long ----windows(4 byet) Linux（ 32（4）64（8））--- "-2^31 ~ 2^31-1"  : -32768~32767
        long long--8 byte = 32 bit ----" -2^63 ~ 2^63-1" 
*/
        long long a = 10;
    return 0;
}