

/*
            1.Int  :   1 2 3  4 5 6   -1  -879  -78 

formula:   int  атауы = бастапқы мәні;
        int b = 10; 
        b = 40; 

Заңдылық - 1: Бүтін санды бүтін санға бөлгенде жауап міндетті түрде бүтін сан шыгады 
зандылык - 2  кіші санды улкен санга болгенде 0 шыгад
зандылык - 3  кышы санды улкен санга модуль жасаганда кышы саннын озы шыгады
*/
#include <iostream>
using namespace std; 


int main()
{  

        int a = 5;
        int b = 2;
        cout << a/b << endl;    // 5/2 = 2.5

        cout << (1/2) << endl;  // 0.5

        // % - модуль - екы санды болгенде шыгатын калдыгын есептейды
        cout << (5%2) << endl; // 1


        cout << (2%5) << endl;  // 2 
        
        
        int q = 32768;

        long long d = 7885455;
        
/*
        int  ----4 byte = 32 bit ---" -2^31 ~ 2^31-1 "  ：-2147483647.~2147483647.
       short----2 byte = 16 bit ---" -2^15 ~ 2^15 "  ：-32768~32767
        long ----windows(4 byet) Linux（ 32（4）64（8））--- "-2^31 ~ 2^31-1"  : -32768~32767
        long long--8 byte = 32 bit ----" -2^63 ~ 2^63-1" 
*/
    return 0;
}