
         1. vector жалпы түсінік

** Функциясы :

* vector массивке уксайды, немесе бір жақты массив деп аталады


**айырмашылығы : 

* массивта тұрақты памят, ал векторда динамикалық

** Динамикалық түрде өзгерту:


         front():                                                                                            back():
            1          2       3       4       5       6        7        8     9       10         11           12
v.rend() v.begin()                                                                                        v.rbegain()  v.end()


v.insert() - кез келген орынға элемент салу