#include <bits/stdc++.h>

using namespace std;

/*
    Loop  - цикл - үздіксіз қайталанатын процесс!
    программада үздіксіз қайталануға болмайды, сол үшін әр циклда шыгатын бір есік болу керек, 
    бір условия қоюуымыз керек, чтобы сол условияга кезыккенде цикл токтау керек

    for - while ,                   do while
*/
int main()
{
    
    // 1. formulasy : while(условия) { орындалатын кодтар }

    int a = 10;
    while(a > 0)  // пока что 
    {
        cout << a << " ";
        a--;    // a = a-1;
    }
    


    // Esep -1 : 0 1 2 3 4 5 6 7 8 9

    int b = 0;
    while(b < 10)
    {
        cout << b << " ";
        b++; // b = b+1;
    }
    cout << endl;

    // Esep-2: 2~10 : 2 4 6 8 10
    /*
        a = a+1     a++  a+=1
        a = a+2     a += 2
        a = a+3     a += 3;

        a = a-1     a--    a-=1
        a = a-2     a -= 2
    */
    int c = 2;
    while(c <= 10)
    {
        cout << c << " ";
        c = c + 2; 
        c += 2;
    }   // 2  4 6 8 10

    //  Esep-3: 11 9 7 5 3 1 
    int i = 11;
    while(i >= 1)
    {
        cout << i << " ";
        i = i - 2;  // i -= 2
    }
    

    return 0; //
}