#include <bits/stdc++.h>

using namespace std;

/*
    Loop  - цикл - үздіксіз қайталанатын процесс!
    программада үздіксіз қайталануға болмайды, сол үшін әр циклда шыгатын бір есік болу керек, 
    бір условия қоюуымыз керек, чтобы сол условияга кезыккенде цикл токтау керек

    for - while ,                   do while
*/
int main()
{
    
    // 1. formulasy : do{ орындалатын кодтар } while(условия)

    int a = 10;
    while(a > 0)  // пока что 
    {
        cout << a << " ";
        a--;    // a = a-1;
    }   // 10 9 8 7 6 5 4 3 2 1 
    cout << endl;

    int b = 10;
    do
    {
        cout << b << " ";
        b--;
    } while (b > 0);
    
    cout << endl << "----------------------------------------------------" << endl;

    // Esep -1 : 0 1 2 3 4 5 6 7 8 9
    int c = 0;
    do
    {
        cout << c << " ";
        c++;
    } while (c < 10);   // пока что

    cout << endl << " ----------------------------------------" << endl;
    // Esep-2: 2~10 : 2 4 6 8 10
    int d = 2;
    do
    {
        cout << d << " ";
        d += 2; // d = d+2;
    } while (d <= 10);  // d < 11

    cout << endl << " ----------------------------------------" << endl;

    //  Esep-3: 11 9 7 5 3 1 
    int e = 11;
    do
    {
        cout << e << " ";
        e = e - 2;  // e -= 2
    } while (e >= 1);   // e > 0  
    

    return 0; //
}